Revit 2027 API
TableSectionData.ResetCellOverride(Int32) Method
 Resets the override of the column.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ResetCellOverride(
	int nCol
)
Public Sub ResetCellOverride (
	nCol As Integer
)
public:
void ResetCellOverride(
	int nCol
)
member ResetCellOverride :
        nCol : int -> unit
Parameters
nCol Int32
Exceptions
Exception | Condition
ArgumentException |  The given column number nCol is invalid.
See Also
Reference
TableSectionData Class
ResetCellOverride Overload
Autodesk.Revit.DB Namespace